#**Selección de datos**

Una de las habilidades fundamentales que requiere todo Data Scientist es saber manipular y seleccionar los datos correctamente. Ni siquiera el mejor modelo de machine learning es capaz de hacer magia cuando los datos que ingresamos no son los adecuados.

Pandas y numpy son dos librerías de python que nos facilitan nuestro trabajo diario al preparar y explorar los datos.

Comencemos por importar las librerías que usaremos:

In [2]:
import pandas as pd
import numpy as np

Usaremos la función read_csv para leer nuestros datos. Pasamos la ruta al archivo como primer argumento de la función.

Con el parámetro 'delimiter' especificamos el caracter que separa nuestros datos.

También usaremos el parámetro 'index_col' para seleccionar la primera columna de datos como índice.

In [3]:
df = pd.read_csv('sample_data.csv', delimiter=';', index_col = 0)
df

          state  color    food  age  height score
Jane         NY   blue   Steak   30     165   4,6
Niko         TX  green    Lamb    2      70   8,3
Aaron        FL    red   Mango   12     120     9
Penelope     AL  white   Apple    4      80   3,3
Dean         AK   gray  Cheese   32     180   1,8
Christina    TX  black   Melon   33     172   8,5
Cornelia     TX    red   Beans   69     150   2,2

##**Seleccionar columnas**

Para seleccionar una columna, simplemente colocamos su nombre entre [ ]

Al seleccionar una sola columna, pandas devuelve una serie (secuencia de una sola dimensión)

In [ ]:
df['age']

Jane         30
Niko          2
Aaron        12
Penelope      4
Dean         32
Christina    33
Cornelia     69
Name: age, dtype: int64

Para seleccionar más de una columna, pasamos una lista con el nombre de las columnas que queremos ver. Recordemos que para crear una lista en python usamos los símbolos [ ]

In [ ]:
df[['age', 'color']]

           age  color
Jane        30   blue
Niko         2  green
Aaron       12    red
Penelope     4  white
Dean        32   gray
Christina   33  black
Cornelia    69    red

Como podemos ver, seleccionar mas de una columna nos devuelve un dataframe.

Si queremos que pandas nos devuelva una sola columna como dataframe, usamos de nuevo una lista de un solo elemento con el nombre de la columna

In [ ]:
df[['age']]

           age
Jane        30
Niko         2
Aaron       12
Penelope     4
Dean        32
Christina   33
Cornelia    69

##**Seleccionar datos usando .loc**

Con .loc podemos seleccionar subconjuntos de filas o columnas. También podemos seleccionar simultáneamente subconjuntos de filas y columnas.

In [ ]:
df.loc[['Niko']]

     state  color  food  age  height score
Niko    TX  green  Lamb    2      70   8,3

###**Seleccionar múltiples filas**

In [ ]:
df.loc[['Niko', 'Penelope']]

         state  color   food  age  height score
Niko        TX  green   Lamb    2      70   8,3
Penelope    AL  white  Apple    4      80   3,3

Podemos trabajar al igual que con las listas en python.

Traer las filas desde Niko hasta Dean. Usamos slice notation, indicando el valor inicial y el final

In [ ]:
df.loc ['Niko': 'Dean']

         state  color    food  age  height score
Niko        TX  green    Lamb    2      70   8,3
Aaron       FL    red   Mango   12     120     9
Penelope    AL  white   Apple    4      80   3,3
Dean        AK   gray  Cheese   32     180   1,8

Observemos que a diferencia de las listas en python, .loc incluye el último elemento seleccionado.

Seleccionemos los datos desde el principio hasta Aaron

In [ ]:
df.loc [:'Aaron']

      state  color   food  age  height score
Jane     NY   blue  Steak   30     165   4,6
Niko     TX  green   Lamb    2      70   8,3
Aaron    FL    red  Mango   12     120     9

Desde Niko hasta Christina, de a dos saltos

In [ ]:
df.loc ['Niko':'Christina':2]

          state  color   food  age  height score
Niko         TX  green   Lamb    2      70   8,3
Penelope     AL  white  Apple    4      80   3,3
Christina    TX  black  Melon   33     172   8,5

Desde Dean hasta el final

In [ ]:
df.loc ['Dean':]

          state  color    food  age  height score
Dean         AK   gray  Cheese   32     180   1,8
Christina    TX  black   Melon   33     172   8,5
Cornelia     TX    red   Beans   69     150   2,2

###***Seleccionar múltiples filas y columnas***

Solo basta con separar las filas y columnas a buscar con una coma. La estructura es la siguiente:

df.loc [row_selection, column_selection]

In [ ]:
df

          state  color    food  age  height score
Jane         NY   blue   Steak   30     165   4,6
Niko         TX  green    Lamb    2      70   8,3
Aaron        FL    red   Mango   12     120     9
Penelope     AL  white   Apple    4      80   3,3
Dean         AK   gray  Cheese   32     180   1,8
Christina    TX  black   Melon   33     172   8,5
Cornelia     TX    red   Beans   69     150   2,2

Por ejemplo, si quisiéramos seleccionar las filas 'Dean' y 'Cornelia' junto con las columnas 'age', 'state' y 'score' haríamos esto:

In [ ]:
df.loc[['Dean', 'Cornelia'], ['age', 'state', 'score']]

          age state score
Dean       32    AK   1,8
Cornelia   69    TX   2,2

Seleccionar dos filas y una columna

In [ ]:
df.loc[['Jane', 'Penelope'], 'color']

Jane         blue
Penelope    white
Name: color, dtype: object

Si queremos convertir la serie que obtenemos en un dataframe, podemos guardar la selección en una variable y usar la función de pandas .DataFrame

In [ ]:
people = df.loc[['Jane', 'Penelope'], 'color']
students = pd.DataFrame(people)
students

          color
Jane       blue
Penelope  white

Seleccionar varias filas y columnas

In [ ]:
df.loc['Jane':'Penelope', ['state', 'color']]

         state  color
Jane        NY   blue
Niko        TX  green
Aaron       FL    red
Penelope    AL  white

Si seleccionamos una sola fila y una sola columna, nos devuelve un valor escalar

In [ ]:
df.loc['Jane','age']

30

seleccionar un slice de filas y columnas

In [ ]:
df.loc[:'Dean', 'food':]

            food  age  height score
Jane       Steak   30     165   4,6
Niko        Lamb    2      70   8,3
Aaron      Mango   12     120     9
Penelope   Apple    4      80   3,3
Dean      Cheese   32     180   1,8

Seleccionar todas las filas y algunas columnas

In [ ]:
df.loc[:,['age', 'score']]

           age score
Jane        30   4,6
Niko         2   8,3
Aaron       12     9
Penelope     4   3,3
Dean        32   1,8
Christina   33   8,5
Cornelia    69   2,2

Asignar columnas y filas a variables

In [ ]:
rows = ['Jane', 'Niko', 'Dean', 'Penelope', 'Christina']
cols = ['state', 'age', 'height', 'score']
df.loc[rows, cols]

          state  age  height score
Jane         NY   30     165   4,6
Niko         TX    2      70   8,3
Dean         AK   32     180   1,8
Penelope     AL    4      80   3,3
Christina    TX   33     172   8,5

##**Seleccionar datos usando .iloc**

.iloc es muy similar a .loc, con la diferencia de que solo usa los índices para hacer las selecciones.

In [ ]:
df

          state  color    food  age  height score
Jane         NY   blue   Steak   30     165   4,6
Niko         TX  green    Lamb    2      70   8,3
Aaron        FL    red   Mango   12     120     9
Penelope     AL  white   Apple    4      80   3,3
Dean         AK   gray  Cheese   32     180   1,8
Christina    TX  black   Melon   33     172   8,5
Cornelia     TX    red   Beans   69     150   2,2

Al pasar un entero, .iloc nos devuelve una fila como serie.

In [ ]:
df.iloc[3]

state        AL
color     white
food      Apple
age           4
height       80
score       3,3
Name: Penelope, dtype: object

también podemos seleccionar múltiples filas

In [ ]:
df.iloc[[0,2]]

      state color   food  age  height score
Jane     NY  blue  Steak   30     165   4,6
Aaron    FL   red  Mango   12     120     9

**Importante**: Tener cuidado de no usar [0,2] ya que esto lo que hará es devolvernos el dato que se encuentra en la fila 0 y la columna 2

In [ ]:
df.iloc[0,2]

'Steak'

Al igual que con .loc, podemos usar slice notation para seleccionar un rango de filas. Nótese que a diferencia de .loc, no se incluye el último elemento de la lista.

In [ ]:
df.iloc[1:4]

         state  color   food  age  height score
Niko        TX  green   Lamb    2      70   8,3
Aaron       FL    red  Mango   12     120     9
Penelope    AL  white  Apple    4      80   3,3

Seleccionar desde la segunda posición hasta el final

In [ ]:
df.iloc[2:]

          state  color    food  age  height score
Aaron        FL    red   Mango   12     120     9
Penelope     AL  white   Apple    4      80   3,3
Dean         AK   gray  Cheese   32     180   1,8
Christina    TX  black   Melon   33     172   8,5
Cornelia     TX    red   Beans   69     150   2,2

Seleccionar desde la segunda posición hasta el final, de a dos saltos

In [ ]:
df.iloc[2::2]

         state color    food  age  height score
Aaron       FL   red   Mango   12     120     9
Dean        AK  gray  Cheese   32     180   1,8
Cornelia    TX   red   Beans   69     150   2,2

###**Seleccionar filas y columnas simultáneamente**

In [ ]:
df.iloc[[0,2],[2,3]]

        food  age
Jane   Steak   30
Aaron  Mango   12

Seleccionar un rango de filas y varias columnas

In [ ]:
df.iloc[2:4,[3,4]]

          age  height
Aaron      12     120
Penelope    4      80

Seleccionar todas las filas y un rango de columnas

In [ ]:
df.iloc[:,0:2]

          state  color
Jane         NY   blue
Niko         TX  green
Aaron        FL    red
Penelope     AL  white
Dean         AK   gray
Christina    TX  black
Cornelia     TX    red

##**Seleccionar datos usando filtros**

Pandas nos permite filtrar los datos que cumplan con alguna condición específica, usando los operadores <, >, ==.

In [4]:
df

          state  color    food  age  height score
Jane         NY   blue   Steak   30     165   4,6
Niko         TX  green    Lamb    2      70   8,3
Aaron        FL    red   Mango   12     120     9
Penelope     AL  white   Apple    4      80   3,3
Dean         AK   gray  Cheese   32     180   1,8
Christina    TX  black   Melon   33     172   8,5
Cornelia     TX    red   Beans   69     150   2,2

Vamos a seleccionar las personas mayores de edad (mayores de 18 años).

In [9]:
df['age']>18

Jane          True
Niko         False
Aaron        False
Penelope     False
Dean          True
Christina     True
Cornelia      True
Name: age, dtype: bool

Vemos que pandas nos devuelve un booleano, indicando las filas donde la condición es evaluada como falsa o verdadera. Si queremos que nos devuelva un dataframe, incluimos la condición entre [ ].

In [7]:
filter = df[df['age'] > 18]
filter

          state  color    food  age  height score
Jane         NY   blue   Steak   30     165   4,6
Dean         AK   gray  Cheese   32     180   1,8
Christina    TX  black   Melon   33     172   8,5
Cornelia     TX    red   Beans   69     150   2,2

También podemos usar los operadores or ( | ) o and ( &) para definir más de una condición

Recordemos que usamos el operador "or" cuando queremos que al menos una de las condiciones sea verdadera. En este caso filtraremos las personas que prefieren el color rojo o azul.

In [12]:
color_or = df[(df['color'] == 'blue') | (df['color'] == 'red')]
color_or

         state color   food  age  height score
Jane        NY  blue  Steak   30     165   4,6
Aaron       FL   red  Mango   12     120     9
Cornelia    TX   red  Beans   69     150   2,2

Igualmente, usamos el operador "and" cuando queremos que las dos condiciones sean evaluadas como verdaderas. Para este caso, filtraremos las personas que prefieren el color rojo y el mango.

In [14]:
color_and = df[(df['color'] == 'red') & (df['food'] == 'Mango')]
color_and

      state color   food  age  height score
Aaron    FL   red  Mango   12     120     9

También podemos combinar el operador .loc y alguna condición para realizar el filtro. En ese caso, definimos la condición y luego de la coma indicamos la columna que queremos obtener.

In [17]:
adult_names = df.loc[df["age"] > 18, 'score']
adult_names

Jane         4,6
Dean         1,8
Christina    8,5
Cornelia     2,2
Name: score, dtype: object